In [96]:
import pandas as pd

In [101]:
df = pd.read_csv('data/clean_tweets.csv')
df['created_at'] = list(map(lambda x: x[:-5], df['created_at']))
df['created_at'] = pd.to_datetime(df['created_at'])

df.head(6)

,id,tweet,created_at,user_id,name,username,retweets_count,replies_count,likes_count,quote_url
0,1528696920729956352,Terminando el desafio de tripulaciones en @The...,2022-05-23 13:18:42,1528649918306557952,Nacho Esteban,nachooatm82,0,0,0,NaN
1,1528650844094271490,"""El libro de la inteligencia colectiva"" http...",2022-05-23 10:15:36,41545659,Mario Lopez de Avila,nodosenlared,2,0,5,NaN
2,1528647207594909696,Este jueves nos vemos en @TheBridge_Tech para ...,2022-05-23 10:01:09,4628161,Tíscar Lara,tiscar,0,0,1,https://twitter.com/arey/status/15286383075166...
3,1528641426975760389,Conoce las 25 ofertas de #empleo de la empresa...,2022-05-23 09:38:11,987388686,Juan Luis Pavón,juanluispavon1,2,0,6,NaN
4,1528638307516694529,#LastMinute La 2da presentación del #LibroIC e...,2022-05-23 09:25:47,15993641,Amalio A. Rey,arey,1,0,2,NaN
5,1527312943397806080,¡Qué poco queda para el próximo 🔥Burn Monday🔥!...,2022-05-19 17:39:16,1162694149956603904,The Bridge,thebridge_tech,2,0,0,NaN

# A

In [61]:
df[(df['likes_count']==df['likes_count'].max())]

,id,tweet,created_at,user_id,name,username,retweets_count,replies_count,likes_count,quote_url
24,1519706866703638529,En breve empezamos la charla sobre RV y Psicol...,2022-05-23 02:00:00,3294953441,Jose Maria Torralba,jm_torralba_,1,0,15,NaN

# B

In [62]:
df.groupby('username')[['tweet']].count().sort_values(by='tweet', ascending=False)

                tweet
username
thebridge_tech     53
mujeresaseguir      7
bertinha84          5
indracompany        3
funiversia          3
...               ...
graphext            1
ing_titiritero      1
insidezeusdata      1
alberto_blanco      1
zoomtecnochile      1

[62 rows x 1 columns]

# C

In [107]:
df['month'] = list(map(lambda x: x.month, df['created_at']))

df.groupby('month')[['tweet']].count().sort_values(by='tweet', ascending=False)

       tweet
month
4         49
3         27
5         23
2          1

# D

In [89]:
from collections import Counter

Counter(" ".join(df["tweet"]).split()).most_common(100)[:10]

[('de', 243),
 ('en', 130),
 ('y', 95),
 ('@TheBridge_Tech', 81),
 ('la', 79),
 ('el', 77),
 ('que', 72),
 ('a', 69),
 ('con', 54),
 ('las', 45)]